{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<eos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<bos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": false,
    "use_regex": true
  },
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "vocab": {
      "<pad>": 0,
      "<eos>": 1,
      "<bos>": 2,
      "<unk>": 3,
      "!": 4,
      "\"": 5,
      "#": 6,
      "$": 7,
      "%": 8,
      "&": 9,
      "'": 10,
      "(": 11,
      ")": 12,
      "*": 13,
      "+": 14,
      ",": 15,
      "-": 16,
      ".": 17,
      "/": 18,
      "0": 19,
      "1": 20,
      "2": 21,
      "3": 22,
      "4": 23,
      "5": 24,
      "6": 25,
      "7": 26,
      "8": 27,
      "9": 28,
      ":": 29,
      ";": 30,
      "<": 31,
      "=": 32,
      ">": 33,
      "?": 34,
      "@": 35,
      "A": 36,
      "B": 37,
      "C": 38,
      "D": 39,
      "E": 40,
      "F": 41,
      "G": 42,
      "H": 43,
      "I": 44,
      "J": 45,
      "K": 46,
      "L": 47,
      "M": 48,
      "N": 49,
      "O": 50,
      "P": 51,
      "Q": 52,
      "R": 53,
      "S": 54,
      "T": 55,
      "U": 56,
      "V": 57,
      "W": 58,
      "X": 59,
      "Y": 60,
      "Z": 61,
      "[": 62,
      "\\": 63,
      "]": 64,
      "^": 65,
      "_": 66,
      "`": 67,
      "a": 68,
      "b": 69,
      "c": 70,
      "d": 71,
      "e": 72,
      "f": 73,
      "g": 74,
      "h": 75,
      "i": 76,
      "j": 77,
      "k": 78,
      "l": 79,
      "m": 80,
      "n": 81,
      "o": 82,
      "p": 83,
      "q": 84,
      "r": 85,
      "s": 86,
      "t": 87,
      "u": 88,
      "v": 89,
      "w": 90,
      "x": 91,
      "y": 92,
      "z": 93,
      "{": 94,
      "|": 95,
      "}": 96,
      "~": 97,
      "¡": 98,
      "¢": 99,
      "£": 100,
      "¤": 101,
      "¥": 102,
      "¦": 103,
      "§": 104,
      "¨": 105,
      "©": 106,
      "ª": 107,
      "«": 108,
      "¬": 109,
      "®": 110,
      "¯": 111,
      "°": 112,
      "±": 113,
      "²": 114,
      "³": 115,
      "´": 116,
      "µ": 117,
      "¶": 118,
      "·": 119,
      "¸": 120,
      "¹": 121,
      "º": 122,
      "»": 123,
      "¼": 124,
      "½": 125,
      "¾": 126,
      "¿": 127,
      "À": 128,
      "Á": 129,
      "Â": 130,
      "Ã": 131,
      "Ä": 132,
      "Å": 133,
      "Æ": 134,
      "Ç": 135,
      "È": 136,
      "É": 137,
      "Ê": 138,
      "Ë": 139,
      "Ì": 140,
      "Í": 141,
      "Î": 142,
      "Ï": 143,
      "Ð": 144,
      "Ñ": 145,
      "Ò": 146,
      "Ó": 147,
      "Ô": 148,
      "Õ": 149,
      "Ö": 150,
      "×": 151,
      "Ø": 152,
      "Ù": 153,
      "Ú": 154,
      "Û": 155,
      "Ü": 156,
      "Ý": 157,
      "Þ": 158,
      "ß": 159,
      "à": 160,
      "á": 161,
      "â": 162,
      "ã": 163,
      "ä": 164,
      "å": 165,
      "æ": 166,
      "ç": 167,
      "è": 168,
      "é": 169,
      "ê": 170,
      "ë": 171,
      "ì": 172,
      "í": 173,
      "î": 174,
      "ï": 175,
      "ð": 176,
      "ñ": 177,
      "ò": 178,
      "ó": 179,
      "ô": 180,
      "õ": 181,
      "ö": 182,
      "÷": 183,
      "ø": 184,
      "ù": 185,
      "ú": 186,
      "û": 187,
      "ü": 188,
      "ý": 189,
      "þ": 190,
      "ÿ": 191,
      "Ā": 192,
      "ā": 193,
      "Ă": 194,
      "ă": 195,
      "Ą": 196,
      "ą": 197,
      "Ć": 198,
      "ć": 199,
      "Ĉ": 200,
      "ĉ": 201,
      "Ċ": 202,
      "ċ": 203,
      "Č": 204,
      "č": 205,
      "Ď": 206,
      "ď": 207,
      "Đ": 208,
      "đ": 209,
      "Ē": 210,
      "ē": 211,
      "Ĕ": 212,
      "ĕ": 213,
      "Ė": 214,
      "ė": 215,
      "Ę": 216,
      "ę": 217,
      "Ě": 218,
      "ě": 219,
      "Ĝ": 220,
      "ĝ": 221,
      "Ğ": 222,
      "ğ": 223,
      "Ġ": 224,
      "ġ": 225,
      "Ģ": 226,
      "ģ": 227,
      "Ĥ": 228,
      "ĥ": 229,
      "Ħ": 230,
      "ħ": 231,
      "Ĩ": 232,
      "ĩ": 233,
      "Ī": 234,
      "ī": 235,
      "Ĭ": 236,
      "ĭ": 237,
      "Į": 238,
      "į": 239,
      "İ": 240,
      "ı": 241,
      "Ĳ": 242,
      "ĳ": 243,
      "Ĵ": 244,
      "ĵ": 245,
      "Ķ": 246,
      "ķ": 247,
      "ĸ": 248,
      "Ĺ": 249,
      "ĺ": 250,
      "Ļ": 251,
      "ļ": 252,
      "Ľ": 253,
      "ľ": 254,
      "Ŀ": 255,
      "ŀ": 256,
      "Ł": 257,
      "ł": 258,
      "Ń": 259,
      "CC": 260,
      "CCCC": 261,
      "CCCCCCCC": 262,
      "(=": 263,
      "OC": 264,
      "](": 265,
      ")(": 266,
      "CO": 267,
      "@@": 268,
      "COP": 269,
      "COC": 270,
      "CCC": 271,
      "CCCCCCCCCCCCCCCC": 272,
      "CCCCC": 273,
      "cc": 274,
      "CCCCCCCCCCCC": 275,
      "CCCCCCCCC": 276,
      ")[": 277,
      "CCCCCCCCCCC": 278,
      "CCCCCCCCCCCCC": 279,
      "CCCCCC": 280,
      "CCCCCCC": 281,
      "CCCCCCCCCCCCCCCCC": 282,
      "CCCCCCCCCCCCCCCCCCCCC": 283,
      "CCCCCCCCCC": 284,
      "CCCCCCCCCCCCCCC": 285,
      "CCCCCCCCCCCCCC": 286,
      "ccc": 287,
      "CCCCCCCCCCCCCCCCCCC": 288,
      "CCCCCCCCCCCCCCCCCC": 289,
      "NC": 290,
      "OCC": 291,
      ")/": 292,
      "nc": 293,
      "OP": 294,
      "-]": 295,
      "CCCCCCCCCCCCCCCCCCCC": 296,
      ")=": 297,
      "/[": 298,
      "CCCCCCCCCCCCCCCCCCCCCC": 299,
      "-])": 300,
      "CCCCCCCCCCCCCCCCCCCCCCC": 301,
      "+](": 302,
      "ccccc": 303,
      "\\[": 304,
      "Cc": 305,
      ")([": 306,
      "CCCCCCCCCCCCCCCCCCCCCCCC": 307,
      "OCCN": 308,
      "CCCCCCCCCCCCCCCCCCCCCCCCC": 309,
      "12": 310,
      "oc": 311,
      "Cl": 312,
      "nH": 313,
      "COc": 314,
      "](/": 315,
      "@]": 316,
      "(-": 317,
      "cnc": 318,
      "Oc": 319,
      "CN": 320,
      "CCNC": 321,
      "NCC": 322,
      "cccc": 323,
      "Nc": 324,
      "([": 325,
      "32": 326,
      "SC": 327,
      "ncnc": 328,
      ")(=": 329,
      "CCN": 330,
      "21": 331,
      "+]": 332,
      "CS": 333,
      "@@]": 334,
      "CCCN": 335,
      "(/": 336,
      "CCc": 337,
      "23": 338,
      "SCCNC": 339,
      "CNC": 340,
      "CCCCN": 341,
      "(\\": 342,
      "OCCNC": 343,
      "COCCCCCCCCCCCCCCCCCC": 344,
      "CCCCCc": 345,
      "CCCCCO": 346,
      "43": 347,
      "CCCNC": 348,
      "cn": 349,
      "CCOC": 350,
      "+](=": 351,
      "OS": 352,
      "CCCCCCCCCCc": 353,
      "CCCCCCCCc": 354,
      "ncc": 355,
      ".[": 356,
      "NCCC": 357,
      "ncn": 358,
      "OCCCCCCCCCCCCCCCCCC": 359,
      "OCO": 360,
      "34": 361,
      "]([": 362,
      "Cn": 363,
      "SCC": 364,
      "nn": 365,
      "13": 366,
      "CCO": 367,
      "=[": 368,
      "CCCc": 369,
      "sc": 370,
      "OCc": 371,
      "cccnc": 372,
      "@@](": 373,
      "-])[": 374,
      "NCCSC": 375,
      "+]([": 376,
      "45": 377,
      "NCCCC": 378,
      "coc": 379,
      "NS": 380,
      "CCS": 381,
      "ccnc": 382,
      "ccn": 383,
      "CCSC": 384,
      "CCOCC": 385,
      "CSC": 386,
      "NN": 387,
      "OCCOCC": 388,
      "Sc": 389,
      "@](": 390,
      "NCc": 391,
      "CSCCC": 392,
      "CCOc": 393,
      "NCCc": 394,
      "CCCCCCCCCCCCc": 395,
      "ccoc": 396,
      "-].[": 397,
      "SCCN": 398,
      "Na": 399,
      "CSSCC": 400,
      "Clc": 401,
      "OO": 402,
      ")\\": 403,
      "ccccn": 404,
      "31": 405,
      "CNc": 406,
      "COCC": 407,
      "CCCl": 408,
      "CCNCC": 409,
      "Br": 410,
      "ccco": 411,
      "NO": 412,
      "CCCO": 413,
      "54": 414,
      "OCCC": 415,
      ")-": 416,
      "CSc": 417,
      "35": 418,
      "CCl": 419,
      "CCOP": 420,
      "OCCCCCCC": 421,
      "OCCCCCCCCC": 422,
      "COCCCCCCCCC": 423,
      "]%": 424,
      "nnc": 425,
      "CCCCc": 426,
      "csc": 427,
      "COCCCCCCC": 428,
      "SS": 429,
      "ccncc": 430,
      "nccc": 431,
      "NCCN": 432,
      "14": 433,
      "+].[": 434,
      "NCCCCC": 435,
      "].[": 436,
      "OCCc": 437,
      "10": 438,
      "ON": 439,
      "OCCO": 440,
      "CSCC": 441,
      "56": 442,
      "COS": 443,
      "OCOC": 444,
      "cs": 445,
      "cccs": 446,
      "NCCS": 447,
      "11": 448,
      "ncccc": 449,
      "cncn": 450,
      "CNCC": 451,
      "occc": 452,
      "CCn": 453,
      "CCCCOC": 454,
      "OOC": 455,
      "NCCO": 456,
      "Ca": 457,
      "FC": 458,
      "SSC": 459,
      "CCCOC": 460,
      "-].": 461,
      "OCCCC": 462,
      "24": 463,
      "-])=": 464,
      "OCCOCCOCCOCC": 465,
      "Fe": 466,
      "NNC": 467,
      "NH": 468,
      "ClC": 469,
      "65": 470,
      "no": 471,
      "CCCCNC": 472,
      "cncc": 473,
      "CP": 474,
      "CCCCCCc": 475,
      "-])([": 476,
      "Mg": 477,
      "NCCCN": 478,
      "CON": 479,
      "CCNc": 480,
      "CCCS": 481,
      "NOC": 482,
      "NNc": 483,
      "nccnc": 484,
      "CCCCCCCc": 485,
      "OCCOC": 486,
      "CF": 487,
      "Fc": 488,
      "Si": 489,
      "CCCOc": 490,
      "Se": 491,
      "occ": 492,
      "sccc": 493,
      "SCCC": 494,
      "CCCCCCCCOC": 495,
      "cnn": 496,
      "NP": 497,
      "NCCCCCC": 498,
      "CCCn": 499,
      "CCCCCCCCCCCCCCCCCCCCCCCCCC": 500,
      "Al": 501,
      "CH": 502,
      "SCc": 503,
      "ccsc": 504,
      "CCCCCCOC": 505,
      "ncccn": 506,
      "NCCCCN": 507,
      "OCCCN": 508,
      "noc": 509,
      "CCCCO": 510,
      "CCCCCCCCCCCCCCCCCCOC": 511,
      "15": 512,
      "16": 513,
      "CCSS": 514,
      "][": 515,
      "cnccn": 516,
      "](=": 517,
      "COCc": 518,
      "nccn": 519,
      "CCCCCN": 520,
      "-][": 521,
      "+]=[": 522,
      "nonc": 523,
      "+])": 524,
      "CSSC": 525,
      "cccn": 526,
      "OCCOc": 527,
      "nccs": 528,
      "41": 529,
      "-]=[": 530,
      "+]=": 531,
      "cnccc": 532,
      "nnnn": 533,
      "NOS": 534,
      "COCCOC": 535,
      "cncnc": 536,
      "On": 537,
      "CNCCC": 538,
      "CNCCc": 539,
      "CCSCC": 540,
      "COCCOCC": 541,
      "CCCCCCCCCc": 542,
      "NCCCCNC": 543,
      "42": 544,
      "OCCCCCC": 545,
      "CCCCCOC": 546,
      "(=[": 547,
      "314": 548,
      "OCCOCCOCCOCCOCCOCCOCCOCC": 549,
      "CI": 550,
      "SSCC": 551,
      "NCCCl": 552,
      "nnn": 553,
      "17": 554,
      "As": 555,
      "NOCC": 556,
      "NCCNC": 557,
      "on": 558,
      "COCCCCCCCCCCCCCCCC": 559,
      "CNCc": 560,
      "CCSSC": 561,
      "18": 562,
      "Co": 563,
      "scnc": 564,
      "COCCN": 565,
      "CCCNCC": 566,
      "SN": 567,
      "nsc": 568,
      "CCCCn": 569,
      "CCCCNCC": 570,
      "CCCCCCCCCOC": 571,
      "COCCO": 572,
      "CCCCCCCCCCCCCCCCCCCCCCCCCCCC": 573,
      "CCCCCCCCCCCCCCCCCCCCCCCCCCC": 574,
      "53": 575,
      "OH": 576,
      "SH": 577,
      "SSc": 578,
      "])": 579,
      "CCP": 580,
      "CCCCCCCCN": 581,
      "CCCCCCCCO": 582,
      "CCCCCCN": 583,
      "-])(": 584,
      "CNS": 585,
      "@@](=": 586,
      "NCCCNCCCCN": 587,
      "->": 588,
      "onc": 589,
      "CCOS": 590,
      "CCCCS": 591,
      "CCCCCCCCCO": 592,
      "CCCCCCCOC": 593,
      "NCN": 594,
      "@](=": 595,
      "CCNCc": 596,
      "CSS": 597,
      "NCCCc": 598,
      "CCSc": 599,
      "52": 600,
      "67": 601,
      "OCCCCC": 602,
      "OCCCCCCCCCC": 603,
      "OCCCc": 604,
      "COn": 605,
      "ccnn": 606,
      "CCCCCCCN": 607,
      "ncsc": 608,
      "OCCNCC": 609,
      "321": 610,
      "341": 611,
      "NCCSCc": 612,
      "]/": 613,
      "]=": 614,
      "CCCCNc": 615,
      "CCCSC": 616,
      "-])/": 617,
      "CCNS": 618,
      "CSCc": 619,
      "ncnn": 620,
      "CCSSS": 621,
      "Brc": 622,
      "NCCCCCCN": 623,
      "19": 624,
      "25": 625,
      "Mn": 626,
      "PH": 627,
      "SP": 628,
      "co": 629,
      "CCCCOc": 630,
      "CCCCCCCCCCCCCCCCOC": 631,
      "CCCCCCCCCCCCOC": 632,
      "NCCOC": 633,
      "CSCCN": 634,
      "nnnc": 635,
      "CCSSCC": 636,
      "SiH": 637,
      "78": 638,
      "ONC": 639,
      "ns": 640,
      "CCCSS": 641,
      "CCCCCF": 642,
      "CCCCCCO": 643,
      "OCCCOc": 644,
      "CNCCCC": 645,
      "CNCCCN": 646,
      "NCCOP": 647,
      "cnnn": 648,
      "CCON": 649,
      "cscn": 650,
      "#[": 651,
      "20": 652,
      "64": 653,
      "OB": 654,
      "CCF": 655,
      "OCP": 656,
      "CCCCCCCCCCCCCCCCCCCCCCCCCCCCCC": 657,
      "CCCCCCCCCCCCCCCCOCC": 658,
      "CCCCCn": 659,
      "CCCCCNC": 660,
      "CCCCCCCCCCOC": 661,
      "CCCCCCCCCCCCCCCc": 662,
      "CCCCCCCCCCCCCCCCCCO": 663,
      ")=[": 664,
      "cncs": 665,
      "CNCCNC": 666,
      "CNCCN": 667,
      "NCCNc": 668,
      "CSCCCC": 669,
      "OCCOCCO": 670,
      "SSCCC": 671,
      "SSSC": 672,
      "NCCCCCN": 673,
      "46": 674,
      "<-": 675,
      "Gd": 676,
      "NCO": 677,
      "NCCCNC": 678,
      "NOCc": 679,
      "OCCCCCCCC": 680,
      "OCCCCCCCCCCCC": 681,
      "OCCCl": 682,
      "Sn": 683,
      "SCCc": 684,
      "scc": 685,
      "CCCCCOc": 686,
      "OCN": 687,
      "COCCCCCCCC": 688,
      "CCCNc": 689,
      "CCCSc": 690,
      "CCCSSC": 691,
      "CCCCCCCCCCCc": 692,
      "CCCCCCOc": 693,
      "NCl": 694,
      "OCCn": 695,
      "CNNC": 696,
      "CNCCNCC": 697,
      "NCCNCC": 698,
      "NCCNCCO": 699,
      "CSN": 700,
      "CSCCCCC": 701,
      "cnnc": 702,
      "CCOCc": 703,
      "OCCOCCOCCO": 704,
      "NaH": 705,
      "AlH": 706,
      "NCCCCNCCCN": 707,
      "22": 708,
      "76": 709,
      "Cu": 710,
      "Nn": 711,
      "OCCCCCCCCCCCCCCCC": 712,
      "nncc": 713,
      "CCCCOCC": 714,
      ")(/": 715,
      "COCCCCCCCCCCCCCCCCCCCCCC": 716,
      "COCCNC": 717,
      "COCCOc": 718,
      "CCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCC": 719,
      "CCCCCCCCCS": 720,
      "CCCCCCCCCCO": 721,
      "CCCCCCCCCCCO": 722,
      "CCCCCCCCCCCCCCCO": 723,
      "CCCCCCCCCCCCCCCCCCOCC": 724,
      "ncncc": 725,
      "OCCNc": 726,
      "ClCC": 727,
      "ClCCN": 728,
      "CNCCOc": 729,
      "NCCCO": 730,
      "SCS": 731,
      "CSCN": 732,
      "CCCCNCCC": 733,
      "SCCO": 734,
      "SCCS": 735,
      "NCCCCc": 736,
      "OCCOCCOCCOC": 737,
      "CCCOS": 738,
      "SeH": 739,
      "nsnc": 740,
      "312": 741,
      "87": 742,
      "ONc": 743,
      "OOS": 744,
      "OCCCCc": 745,
      "cH": 746,
      "oncc": 747,
      "CCOCCN": 748,
      "CCCCP": 749,
      "CCCCCCCCS": 750,
      "CCCCCCCCOc": 751,
      "OCOP": 752,
      "COO": 753,
      "COCCC": 754,
      "COCCCCCCCCCCCCCCCCCCCC": 755,
      "COCCc": 756,
      "COCN": 757,
      "CCCCCCCCCCCCN": 758,
      "CCCCCCNC": 759,
      "CCCCCCCOc": 760,
      "CCCCCCCNC": 761,
      "CCCCCCCCCCCCCCO": 762,
      "OCCF": 763,
      "OCCCO": 764,
      "-]#[": 765,
      "CNCCO": 766,
      "CCNCS": 767,
      "NCCCOc": 768,
      "325": 769,
      "SCn": 770,
      "CSCCCCCCCC": 771,
      "CSCCCCCC": 772,
      "CSCCCCCCC": 773,
      "CSSCc": 774,
      "CCOCP": 775,
      "ncco": 776,
      "CCSCCC": 777,
      "CCNCCO": 778,
      "SSS": 779,
      "-](": 780,
      "132": 781,
      "26": 782,
      "27": 783,
      "28": 784,
      "29": 785,
      "36": 786,
      "68": 787,
      "86": 788,
      "96": 789,
      "CBr": 790,
      "Ic": 791,
      "NCCCCCCCC": 792,
      "NCCCCCCC": 793,
      "NNCc": 794,
      "NOCCO": 795,
      "OCCCCN": 796,
      "OCCCCCCCCCCCCCCCCCCCCCCCCCCCC": 797,
      "Pt": 798,
      "ss": 799,
      "CCCOP": 800,
      "CCBr": 801,
      "OCl": 802,
      "COCCCCCCCCCCCC": 803,
      "CONC": 804,
      "CCCP": 805,
      "CCCCCCCCCCCCCCCCCCCCCCCCCCCCC": 806,
      "CCCCCCCCCCCCO": 807,
      "CCCCCCCCCCCCCc": 808,
      "CCCCCCS": 809,
      "CCCCCCCO": 810,
      "CCCCCCCS": 811,
      "CCCCCCCCCCN": 812,
      "CCCCCCCCCCCCCCCCCCN": 813,
      "CCCCCCCCCCCCCCCCCCNC": 814,
      "OCCOCCN": 815,
      "OCCOCCC": 816,
      "CCCCCCCCCCCCCCCCCCCCCO": 817,
      "ocnc": 818,
      "ClCc": 819,
      "CNCCCCCC": 820,
      "NCCOc": 821,
      "SCF": 822,
      "SCSC": 823,
      "+][": 824,
      "CSP": 825,
      "CSCCNC": 826,
      "CSSS": 827,
      "CSSSC": 828,
      "CSSCCC": 829,
      "CCCNCCC": 830,
      "CCCCNCCCN": 831,
      "NCCCS": 832,
      "CCSCc": 833,
      "CCSSSC": 834,
      "CCSSCCC": 835,
      "CCOCCn": 836,
      "CCOCCOC": 837,
      "CCOCCOCCN": 838,
      "OCCOCCOC": 839,
      "COCCOP": 840,
      "COCCOCCNC": 841,
      "CCCOCCOC": 842,
      "nncs": 843,
      "SSSS": 844,
      "cscc": 845,
      "OCCCCO": 846,
      "OCCOCCOCCOCCO": 847,
      "MgH": 848,
      "NCCCCNCCCNC": 849,
      "COCCOCCO": 850,
      "OCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCC": 851,
      "(#": 852,
      ")<-": 853,
      "364": 854,
      "432": 855,
      "543": 856,
      "63": 857,
      "83": 858,
      "Au": 859,
      "Ga": 860,
      "Hg": 861,
      "Mo": 862,
      "NI": 863,
      "Nb": 864,
      "NOc": 865,
      "OOP": 866,
      "OCCCCCc": 867,
      "OCCCCOC": 868,
      "OCCCCCCCCCCCCCCCCCCCCCCCCCC": 869,
      "PO": 870,
      "SCCCC": 871,
      "Te": 872,
      "].": 873,
      "])[": 874,
      "ssc": 875,
      "sccn": 876,
      "CCI": 877,
      "CCCCOP": 878,
      "CCCCSC": 879,
      "CCCCOCc": 880,
      "CCCCON": 881,
      "OCn": 882,
      "OCOc": 883,
      "OCOCCOC": 884,
      "COOC": 885,
      "COCCCCCCCCCCCCCC": 886,
      "COCCCCCCCCCCCCCCCCCCCCCCCC": 887,
      "COCCCN": 888,
      "COCO": 889,
      "COCOC": 890,
      "CCCF": 891,
      "CCCSCC": 892,
      "CCCCCCCCCCCCCCCCO": 893,
      "CCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCC": 894,
      "CCCCCCCCCCCCCCCCCCCCCCCCCCCCCCC": 895,
      "CCCCCS": 896,
      "CCCCCNc": 897,
      "CCCCCCCCCN": 898,
      "CCCCCCCCCCS": 899,
      "CCCCCCCCCCCCCCOC": 900,
      "cccnn": 901,
      "NCP": 902,
      "NCNc": 903,
      "OCCS": 904,
      "OCCl": 905,
      "OCCCOC": 906,
      ")/[": 907,
      "ncon": 908,
      "CCCCCCCCCCCCCCCCCCCCCCCO": 909,
      "CNN": 910,
      "CNO": 911,
      "CNOC": 912,
      "CNCCOC": 913,
      "NCCSCC": 914,
      "ncncn": 915,
      "CCNCCNC": 916,
      "CSn": 917,
      "CSCO": 918,
      "CSCCCCCCCCC": 919,
      "CSCCO": 920,
      "CSSc": 921,
      "CSCCCO": 922,
      "CCCNCCCN": 923,
      "234": 924,
      "CNCN": 925,
      "CCCCNCCCCN": 926,
      "cnoc": 927,
      "CCOCn": 928,
      "NCCCNCC": 929,
      "CCSP": 930,
      "CCSSc": 931,
      "CCOCCO": 932,
      "CSCSC": 933,
      "COCCOCCN": 934,
      "COCCCOc": 935,
      "CCNCCN": 936,
      "BrC": 937,
      "NOCCC": 938,
      "NCCSP": 939,
      "NCCSSCCNC": 940,
      "NCCSSCCN": 941,
      "SSCSS": 942,
      "OCCOCCOCCOCCOCCOCCOCCO": 943,
      "NCCCNCCCC": 944,
      "NCCCNCCCCNC": 945,
      "CCCSP": 946,
      "OCCOCCOCCOCCOCCOCCOCCOCCOCCO": 947,
      "CCCNCCNCCCNCC": 948,
      "NCCCNCCCCNCCCN": 949,
      "30": 950,
      "33": 951,
      "37": 952,
      "38": 953,
      "51": 954,
      "57": 955,
      "75": 956,
      "753": 957,
      "85": 958,
      "89": 959,
      "98": 960,
      "@+]": 961,
      "Bi": 962,
      "BOB": 963,
      "Ce": 964,
      "FCOC": 965,
      "Lu": 966,
      "NCOC": 967,
      "NCCCCCCCCCCC": 968,
      "NOCCN": 969,
      "NNS": 970,
      "NOO": 971,
      "NCCCCCCCCN": 972,
      "OF": 973,
      "ONCC": 974,
      "SF": 975,
      "SO": 976,
      "Sm": 977,
      "SCCCCCC": 978,
      "SCN": 979,
      "SCCCS": 980,
      "Zr": 981,
      "])=": 982,
      "cocc": 983,
      "nncn": 984,
      "sncc": 985,
      "CCCCI": 986,
      "CCCCOCCOCC": 987,
      "CCCCOO": 988,
      "CCCCSSC": 989,
      "CCCCCCCCP": 990,
      "CCCCCCCCNC": 991,
      "CCCCCCCCSC": 992,
      "CCCCCCCCOS": 993,
      "CCCCCCCCCOCCCCCCCCC": 994,
      "OCSC": 995,
      "OCOS": 996,
      "COCCCCC": 997,
      "COCCCCCCCCCC": 998,
      "COSC": 999
    },
    "merges": [
      "C C",
      "CC CC",
      "CCCC CCCC",
      "( =",
      "O C",
      "] (",
      ") (",
      "C O",
      "@ @",
      "CO P",
      "C OC",
      "CC C",
      "CCCCCCCC CCCCCCCC",
      "CCCC C",
      "c c",
      "CCCCCCCC CCCC",
      "CCCCCCCC C",
      ") [",
      "CCCCCCCC CCC",
      "CCCCCCCC CCCCC",
      "CCCC CC",
      "CCCC CCC",
      "CCCCCCCCCCCCCCCC C",
      "CCCCCCCCCCCCCCCC CCCCC",
      "CCCCCCCC CC",
      "CCCCCCCCCCCC CCC",
      "CCCCCCCCCCCC CC",
      "cc c",
      "CCCCCCCCCCCCCCCC CCC",
      "CCCCCCCCCCCCCCCC CC",
      "N C",
      "O CC",
      ") /",
      "n c",
      "O P",
      "- ]",
      "CCCCCCCCCCCCCCCC CCCC",
      ") =",
      "/ [",
      "CCCCCCCCCCCCCCCC CCCCCC",
      "-] )",
      "CCCCCCCCCCCCCCCC CCCCCCC",
      "+ ](",
      "cc ccc",
      "\\ [",
      "C c",
      ")( [",
      "CCCCCCCCCCCCCCCC CCCCCCCC",
      "OCC N",
      "CCCCCCCCCCCCCCCC CCCCCCCCC",
      "1 2",
      "o c",
      "C l",
      "n H",
      "CO c",
      "]( /",
      "@ ]",
      "( -",
      "c nc",
      "O c",
      "C N",
      "CC NC",
      "N CC",
      "cc cc",
      "N c",
      "( [",
      "3 2",
      "S C",
      "nc nc",
      ") (=",
      "CC N",
      "2 1",
      "+ ]",
      "C S",
      "@@ ]",
      "CCC N",
      "( /",
      "CC c",
      "2 3",
      "S CCNC",
      "C NC",
      "CCCC N",
      "( \\",
      "OCC NC",
      "CO CCCCCCCCCCCCCCCCCC",
      "CCCCC c",
      "CCCC CO",
      "4 3",
      "CCC NC",
      "c n",
      "CC OC",
      "+] (=",
      "O S",
      "CCCCCCCCCC c",
      "CCCCCCCC c",
      "n cc",
      ". [",
      "N CCC",
      "nc n",
      "O CCCCCCCCCCCCCCCCCC",
      "OC O",
      "3 4",
      "]( [",
      "C n",
      "S CC",
      "n n",
      "1 3",
      "CC O",
      "= [",
      "CCC c",
      "s c",
      "OC c",
      "ccc nc",
      "@@ ](",
      "-] )[",
      "NCC SC",
      "+]( [",
      "4 5",
      "N CCCC",
      "c oc",
      "N S",
      "CC S",
      "cc nc",
      "cc n",
      "CC SC",
      "CC OCC",
      "C SC",
      "N N",
      "OCC OCC",
      "S c",
      "@ ](",
      "NC c",
      "CS CCC",
      "CC Oc",
      "NCC c",
      "CCCCCCCCCCCC c",
      "cc oc",
      "-] .[",
      "S CCN",
      "N a",
      "CS SCC",
      "Cl c",
      "O O",
      ") \\",
      "cccc n",
      "3 1",
      "CN c",
      "CO CC",
      "CCC l",
      "CC NCC",
      "B r",
      "ccc o",
      "N O",
      "CC CO",
      "5 4",
      "O CCC",
      ") -",
      "CS c",
      "3 5",
      "CC l",
      "CC OP",
      "O CCCCCCC",
      "O CCCCCCCCC",
      "CO CCCCCCCCC",
      "] %",
      "n nc",
      "CCCC c",
      "c sc",
      "CO CCCCCCC",
      "S S",
      "cc ncc",
      "n ccc",
      "NCC N",
      "1 4",
      "+] .[",
      "N CCCCC",
      "] .[",
      "OCC c",
      "1 0",
      "O N",
      "OCC O",
      "CS CC",
      "5 6",
      "CO S",
      "OC OC",
      "c s",
      "ccc s",
      "NCC S",
      "1 1",
      "n cccc",
      "cnc n",
      "CN CC",
      "o ccc",
      "CC n",
      "CCCC OC",
      "O OC",
      "NCC O",
      "C a",
      "F C",
      "S SC",
      "CC COC",
      "-] .",
      "O CCCC",
      "2 4",
      "-] )=",
      "OCCOCC OCCOCC",
      "F e",
      "N NC",
      "N H",
      "Cl C",
      "6 5",
      "n o",
      "CCCC NC",
      "cn cc",
      "C P",
      "CCCCCC c",
      "-] )([",
      "M g",
      "N CCCN",
      "CO N",
      "CC Nc",
      "CCC S",
      "N OC",
      "N Nc",
      "ncc nc",
      "CCCCCCC c",
      "OCC OC",
      "C F",
      "F c",
      "S i",
      "CC COc",
      "S e",
      "o cc",
      "s ccc",
      "S CCC",
      "CCCCCCCC OC",
      "cn n",
      "N P",
      "N CCCCCC",
      "CCC n",
      "CCCCCCCCCCCCCCCC CCCCCCCCCC",
      "A l",
      "C H",
      "S Cc",
      "cc sc",
      "CCCCCC OC",
      "nccc n",
      "N CCCCN",
      "O CCCN",
      "n oc",
      "CCCC O",
      "CCCCCCCCCCCCCCCCCC OC",
      "1 5",
      "1 6",
      "CCS S",
      "] [",
      "cn ccn",
      "] (=",
      "COC c",
      "ncc n",
      "CCCCC N",
      "-] [",
      "+] =[",
      "no nc",
      "+] )",
      "CS SC",
      "ccc n",
      "OCC Oc",
      "ncc s",
      "4 1",
      "-] =[",
      "+] =",
      "cn ccc",
      "nn nn",
      "N OS",
      "CO CCOC",
      "cnc nc",
      "O n",
      "CN CCC",
      "CN CCc",
      "CC SCC",
      "CO CCOCC",
      "CCCCCCCCC c",
      "NCCCC NC",
      "4 2",
      "O CCCCCC",
      "CCCC COC",
      "(= [",
      "31 4",
      "OCCOCCOCCOCC OCCOCCOCCOCC",
      "C I",
      "S SCC",
      "NCCC l",
      "nn n",
      "1 7",
      "A s",
      "N OCC",
      "N CCNC",
      "o n",
      "CO CCCCCCCCCCCCCCCC",
      "CNC c",
      "CCS SC",
      "1 8",
      "C o",
      "s cnc",
      "CO CCN",
      "CCC NCC",
      "S N",
      "n sc",
      "CCCC n",
      "CCCC NCC",
      "CCCCCCCC COC",
      "CO CCO",
      "CCCCCCCCCCCCCCCC CCCCCCCCCCCC",
      "CCCCCCCCCCCCCCCC CCCCCCCCCCC",
      "5 3",
      "O H",
      "S H",
      "S Sc",
      "] )",
      "CC P",
      "CCCCCCCC N",
      "CCCCCCCC O",
      "CCCCCC N",
      "-] )(",
      "CN S",
      "@@] (=",
      "NCCCN CCCCN",
      "- >",
      "o nc",
      "CC OS",
      "CCCC S",
      "CCCCCCCC CO",
      "CCCCCC COC",
      "NC N",
      "@] (=",
      "CCNC c",
      "CS S",
      "NCCC c",
      "CCS c",
      "5 2",
      "6 7",
      "O CCCCC",
      "O CCCCCCCCCC",
      "O CCCc",
      "CO n",
      "cc nn",
      "CCCCCCC N",
      "nc sc",
      "OCCN CC",
      "32 1",
      "34 1",
      "NCCS Cc",
      "] /",
      "] =",
      "CCCC Nc",
      "CCC SC",
      "-] )/",
      "CCN S",
      "CS Cc",
      "ncn n",
      "CCS SS",
      "Br c",
      "NCCCCCC N",
      "1 9",
      "2 5",
      "M n",
      "P H",
      "S P",
      "c o",
      "CCCC Oc",
      "CCCCCCCCCCCCCCCC OC",
      "CCCCCCCCCCCC OC",
      "NCC OC",
      "CS CCN",
      "nn nc",
      "CCS SCC",
      "Si H",
      "7 8",
      "O NC",
      "n s",
      "CCC SS",
      "CCCCC F",
      "CCCCCC O",
      "OCC COc",
      "CN CCCC",
      "CN CCCN",
      "NCC OP",
      "cn nn",
      "CCO N",
      "cs cn",
      "# [",
      "2 0",
      "6 4",
      "O B",
      "CC F",
      "OC P",
      "CCCCCCCCCCCCCCCC CCCCCCCCCCCCCC",
      "CCCCCCCCCCCCCCCC OCC",
      "CCCCC n",
      "CCCCC NC",
      "CCCCCCCCCC OC",
      "CCCCCCCCCCCCCCC c",
      "CCCCCCCCCCCCCCCCCC O",
      ")= [",
      "cnc s",
      "CN CCNC",
      "CN CCN",
      "NCC Nc",
      "CS CCCC",
      "OCCOCC O",
      "SS CCC",
      "SS SC",
      "NCCCCC N",
      "4 6",
      "< -",
      "G d",
      "N CO",
      "N CCCNC",
      "N OCc",
      "O CCCCCCCC",
      "O CCCCCCCCCCCC",
      "O CCCl",
      "S n",
      "S CCc",
      "s cc",
      "CCCC COc",
      "OC N",
      "CO CCCCCCCC",
      "CCC Nc",
      "CCC Sc",
      "CCC SSC",
      "CCCCCCCCCCC c",
      "CCCCCC Oc",
      "NC l",
      "OCC n",
      "CN NC",
      "CN CCNCC",
      "NCC NCC",
      "NCC NCCO",
      "CS N",
      "CS CCCCC",
      "cn nc",
      "CCOC c",
      "OCCOCC OCCO",
      "Na H",
      "Al H",
      "NCCCCN CCCN",
      "2 2",
      "7 6",
      "C u",
      "N n",
      "O CCCCCCCCCCCCCCCC",
      "n ncc",
      "CCCC OCC",
      ")( /",
      "CO CCCCCCCCCCCCCCCCCCCCCC",
      "CO CCNC",
      "CO CCOc",
      "CCCCCCCCCCCCCCCC CCCCCCCCCCCCCCCC",
      "CCCCCCCCC S",
      "CCCCCCCCCC O",
      "CCCCCCCCCC CO",
      "CCCCCCCCCCCCCC CO",
      "CCCCCCCCCCCCCCCCCC OCC",
      "nc ncc",
      "OCCN c",
      "Cl CC",
      "Cl CCN",
      "CN CCOc",
      "NCC CO",
      "SC S",
      "CS CN",
      "CCCCN CCC",
      "SCC O",
      "SCC S",
      "NCCCC c",
      "OCCOCC OCCOC",
      "CCCO S",
      "Se H",
      "ns nc",
      "3 12",
      "8 7",
      "O Nc",
      "O OS",
      "O CCCCc",
      "c H",
      "o ncc",
      "CC OCCN",
      "CCCC P",
      "CCCCCCCC S",
      "CCCCCCCC Oc",
      "OC OP",
      "CO O",
      "CO CCC",
      "CO CCCCCCCCCCCCCCCCCCCC",
      "CO CCc",
      "COC N",
      "CCCCCCCCCCCC N",
      "CCCCCC NC",
      "CCCCCC COc",
      "CCCCCCC NC",
      "CCCCCCCCCCCCCC O",
      "OCC F",
      "OCC CO",
      "-] #[",
      "CN CCO",
      "CCNC S",
      "NCC COc",
      "32 5",
      "SC n",
      "CS CCCCCCCC",
      "CS CCCCCC",
      "CS CCCCCCC",
      "CS SCc",
      "CCOC P",
      "ncc o",
      "CCS CCC",
      "CCNCC O",
      "SS S",
      "- ](",
      "1 32",
      "2 6",
      "2 7",
      "2 8",
      "2 9",
      "3 6",
      "6 8",
      "8 6",
      "9 6",
      "C Br",
      "I c",
      "N CCCCCCCC",
      "N CCCCCCC",
      "N NCc",
      "N OCCO",
      "O CCCCN",
      "O CCCCCCCCCCCCCCCCCCCCCCCCCCCC",
      "P t",
      "s s",
      "CC COP",
      "CC Br",
      "OC l",
      "CO CCCCCCCCCCCC",
      "CO NC",
      "CCC P",
      "CCCCCCCCCCCCCCCC CCCCCCCCCCCCC",
      "CCCCCCCCCCCC O",
      "CCCCCCCCCCCCC c",
      "CCCCCC S",
      "CCCCCC CO",
      "CCCCCCC S",
      "CCCCCCCCCC N",
      "CCCCCCCCCCCCCCCCCC N",
      "CCCCCCCCCCCCCCCCCC NC",
      "OCC OCCN",
      "OCC OCCC",
      "CCCCCCCCCCCCCCCCCCCC CO",
      "oc nc",
      "Cl Cc",
      "CN CCCCCC",
      "NCC Oc",
      "SC F",
      "SC SC",
      "+] [",
      "CS P",
      "CS CCNC",
      "CS SS",
      "CS SSC",
      "CS SCCC",
      "CCCN CCC",
      "CCCCN CCCN",
      "NCCC S",
      "CCS Cc",
      "CCS SSC",
      "CCS SCCC",
      "CCOCC n",
      "CCOCC OC",
      "CCOCC OCCN",
      "OCCOCC OC",
      "COCC OP",
      "COCC OCCNC",
      "CCCO CCOC",
      "nnc s",
      "SS SS",
      "cs cc",
      "OCCCC O",
      "OCCOCCOCCOCC O",
      "Mg H",
      "NCCCCN CCCNC",
      "COCCOCC O",
      "OCCOCCOCCOCCOCCOCCOCCOCC OCCOCCOCCOCCOCCOCCOCCOCC",
      "( #",
      ") <-",
      "3 64",
      "4 32",
      "5 43",
      "6 3",
      "8 3",
      "A u",
      "G a",
      "H g",
      "M o",
      "N I",
      "N b",
      "N Oc",
      "O OP",
      "O CCCCCc",
      "O CCCCOC",
      "O CCCCCCCCCCCCCCCCCCCCCCCCCC",
      "P O",
      "S CCCC",
      "T e",
      "] .",
      "] )[",
      "s sc",
      "s ccn",
      "CC I",
      "CCCC OP",
      "CCCC SC",
      "CCCC OCc",
      "CCCC ON",
      "OC n",
      "OC Oc",
      "OC OCCOC",
      "CO OC",
      "CO CCCCCCCCCCCCCC",
      "CO CCCCCCCCCCCCCCCCCCCCCCCC",
      "CO CCCN",
      "COC O",
      "COC OC",
      "CCC F",
      "CCC SCC",
      "CCCCCCCCCCCCCCCC O",
      "CCCCCCCCCCCCCCCC CCCCCCCCCCCCCCCCC",
      "CCCCCCCCCCCCCCCC CCCCCCCCCCCCCCC",
      "CCCCC S",
      "CCCCC Nc",
      "CCCCCCCCC N",
      "CCCCCCCCCC S",
      "CCCCCCCCCCCCCC OC",
      "ccc nn",
      "NC P",
      "NC Nc",
      "OCC S",
      "OCC l",
      "OCC COC",
      ")/ [",
      "nc on",
      "CCCCCCCCCCCCCCCCCCCCCC CO",
      "CN N",
      "CN O",
      "CN OC",
      "CN CCOC",
      "NCC SCC",
      "ncnc n",
      "CCN CCNC",
      "CS n",
      "CS CO",
      "CS CCCCCCCCC",
      "CS CCO",
      "CS Sc",
      "CS CCCO",
      "CCCN CCCN",
      "23 4",
      "CNC N",
      "CCCCN CCCCN",
      "cn oc",
      "CCOC n",
      "NCCC NCC",
      "CCS P",
      "CCS Sc",
      "CCOCC O",
      "CSC SC",
      "COCC OCCN",
      "COCC COc",
      "CCNCC N",
      "Br C",
      "NO CCC",
      "NCCS P",
      "NCCS SCCNC",
      "NCCS SCCN",
      "SSC SS",
      "OCCOCCOCCOCC OCCOCCOCCO",
      "NCCCN CCCC",
      "NCCCN CCCCNC",
      "CCCS P",
      "OCCOCCOCCOCCOCCOCCOCCOCC OCCO",
      "CCCNCC NCCCNCC",
      "NCCCNCCCCN CCCN",
      "3 0",
      "3 3",
      "3 7",
      "3 8",
      "5 1",
      "5 7",
      "7 5",
      "7 53",
      "8 5",
      "8 9",
      "9 8",
      "@ +]",
      "B i",
      "B OB",
      "C e",
      "F COC",
      "L u",
      "N COC",
      "N CCCCCCCCCCC",
      "N OCCN",
      "N NS",
      "N OO",
      "N CCCCCCCCN",
      "O F",
      "O NCC",
      "S F",
      "S O",
      "S m",
      "S CCCCCC",
      "S CN",
      "S CCCS",
      "Z r",
      "] )=",
      "c occ",
      "n ncn",
      "s ncc",
      "CCCC I",
      "CCCC OCCOCC",
      "CCCC OO",
      "CCCC SSC",
      "CCCCCCCC P",
      "CCCCCCCC NC",
      "CCCCCCCC SC",
      "CCCCCCCC OS",
      "CCCCCCCC COCCCCCCCCC",
      "OC SC",
      "OC OS",
      "CO CCCCC",
      "CO CCCCCCCCCC",
      "CO SC"
    ]
  }
}